# 2.จงเขียนโปรแกรมเพื่อใช้ลูป while แสดงเลขจำนวนเต็มจาก 11-50 ถ้าเป็นเลขที่หารด้วย 4
# ลงตัวจะแสดงตัวอักษร ## แทนเลขจำนวนเต็มนั้น โดยจะหยุดแสดงผลเมื่อแสดงเลข 45
# ออกที่จอภาพโดยใช้คำสั่ง break ช่วยในการจัดการ ดังตัวอย่างการรันโปรแกรม

# Using while loop & break !!!
# 11 ## 13 14 15 ## 17 18 19 ##
# 21 22 23 ## 25 26 27 ## 29 30
# 31 ## 33 34 35 ## 37 38 39 ##
# 41 42 43 ## 45


i = 11
count = 0 

while True:
    if i % 4 == 0:
        print("##", end=' ')
    else:
        print(f"{i:>2}", end=' ')

    count += 1
    if count % 10 == 0:
        print()  

    if i == 45:
        break  
    i += 1
