# 3.จงเขียนโปรแกรมโดยลูป while เพื่อแสดงผลของบรรทัดที่ 1 ออกที่จอภาพ หลังจากนั้นให้ใช้ลูป for
# เพื่อแสดงผลของบรรทัดที่ 2-10 ออกที่จอภาพ ดังตัวอย่างการรันโปรแกรม

# 1234567890
# 1        0
# 12       0
# 123      0
# 1234     0
# 12345    0
# 123456   0
# 1234567  0
# 12345678 0
# 1234567890


i = 1
while i <= 10:
    print(i, end='')
    i += 1
print() 

for row in range(1, 10):
    for j in range(1, row + 1): 
        print(j, end='')
    spaces = 9 - row  
    print(' ' * spaces, end='')
    print("0")  
    
for k in range(1, 11):
    print(k, end='')
print()
