#แลปในสไลด์

# 10.1 เขียนโปรแกรมโดยใช้ลูป for ในการพิมพ์เลขจ านวนเต็มจาก 1 ถึง 9
# ออกที่จอภาพ ดังตัวอย่างการรันโปรแกรม
# ตัวอย่างการรันโปรแกรม
# Printing 1 to 9 using for loop ...
# 1, 2, 3, 4, 5, 6, 7, 8 and 9.
# End Program !!!

# =================================================================================

# 10.2 เขียนโปรแกรมโดยใช้ลูป while ในการวนลูปรับเลขจ านวน
# เต็ม 1 ถึง 10 เท่านั้น ถ้าไม่อยู่ในพิสัยให้วนลูปรับข้อมูลใหม่
# จนกว่าจะได้ข้อมูลที่ต้องการ หลังจากนั้น ให้ใช้ลูป while
# เพื่อพิมพ์เลขจ านวนนั้นมาจนถึง 1 โดยพิมพ์เฉพาะเลขคึ่
# เท่านั้น พร้อมกับบอกผลรวมของเลขเหล่านั้นออกที่จอภาพ
# ดังตัวอย่างการรันโปรแกรม
# ตัวอย่างการรันโปรแกรม
# Using while loop ...
# Enter a number (1-10): 30
# Enter a number (1-10): -5
# Enter a number (1-10): 8
# 7 5 3 1
# Sum = 16

# =================================================================================


# extra เขียนโปรแกรมรับเลขจ านวนเต็ม 1 ถึง 9 เท่านั้น
# จ านวน 3 ตัว เก็บไว้ที่ตัวแปร a, b และ c ตามล าดับ
# โดยแต่ละตัวจะต้องไม่ซ้ ากัน ถ้าไม่อยู่ในพิสัยหรือ
# ซ้ ากันให้วนลูปรับข้อมูลใหม่จนกว่าจะได้ข้อมูลที่
# ต้องการ แล้วแสดงค่าทั้ง 3 ออกที่จอภาพ
# ดังตัวอย่างการรันโปรแกรม
# ตัวอย่างการรันโปรแกรม
# Enter number 1 (1-9): 20
# Enter number 1 (1-9): -5
# Enter number 1 (1-9): 6
# -----------------------
# Enter number 2 (1-9): 0
# Enter number 2 (1-9): 6
# 6 is the same as the first number.
# Enter number 2 (1-9): 15
# Enter number 2 (1-9): 9
# -----------------------
# Enter number 3 (1-9): 0
# Enter number 3 (1-9): 11
# Enter number 3 (1-9): 9
# 9 is the same as the second number.
# Enter number 3 (1-9): 6
# 6 is the same as the first number.
# Enter number 3 (1-9): 3
# -----------------------
# a = 6, b = 9 and c = 3

# =================================================================================

# extra จากคลิปที่ผ่านมานั้น (คลิป ปัญหาพิเศษ การใช้ลูป while) เมื่อได้เลขจ านวนเต็ม
# ทั้ง 3 ตัวแล้ว โดยที่แต่ละตัวไม่ซ้ ากันคือ ตัวแปร a = 6, b = 9 และ c = 3
# ให้เขียนโปรแกรมในการเปรียบเทียบ (โดยใช้ if, if else หรือ if elif) เพื่อหาค่า
# ที่น้อยที่สุดและค่าที่มากที่สุด แล้วแสดงเลขจ านวนเต็มตั้งแต่ค่าที่น้อยที่สุดไปจนถึง
# ค่าที่มากที่สุดออกที่จอภาพ ดังตัวอย่างการรันโปรแกรม
# ตัวอย่างการรันโปรแกรม
# a = 6, b = 9 and c = 3
# min = 3
# max = 9
# Printing from 3 to 9: 3 4 5 6 7 8 9