#แลปในสไลด์

# 4.1 ใช้คำสั่ง print('Nakhon Ratchasima') ในหน้าต่าง shell ของโปรแกรม idle เพื่อดูผลลัพธ์
# จากนั้นให้เปิดหน้าต่าง editor เพื่อพิมพ์คำสั่งนั้น ทำการบันทึกแล้วรันโปรแกรมเพื่อดูผลลัพธ์

# print('Nakhon Ratchasima')

# =================================================================================


# 4.2 เปิดโปรแกรม thonny แล้วเขียนโปรแกรมโดยใช้คำสั่ง print() เพื่อแสดงผลออกที่จอภาพ โดยผลลัพธ์บรรทัดสุดท้ายที่แสดง
# Nakhon Ratchasima นั้นเกิดจากการใช้คำสั่ง print() 2 ครั้ง

# print('Using function print ()')
# print('Suranaree University of Technology')
# print('Nakhon',end=' ')
# print('Ratchasima')

# =================================================================================


# 4.3 เขียนโปรแกรมโดยใช้คำสั่ง print() เพื่อแสดงค่าแอสกีของตัวอักษร S U T
# โดยใช้ฟังก์ชัน ord() และใช้ฟังก์ชัน chr() เพื่อแสดงตัวอักษรสัญลักษณ์ ข้าวหลามตัด และ หัวใจ

# print('Using function ord()')
# print(ord('S'))
# print(ord('U'))
# print(ord('T'))
# print('Using function chr()')
# print(chr(9830))
# print(chr(9829))

# =================================================================================


# 4.4 จงเขียนโปรแกรมโดยใช้ค ำสั่ง print เพื่อแสดงข้อมูลอกที่จอภำพดังตัวอย่ำงกำรัน
# โปรแกรม โดยมีข้อก ำหนดดังนี้
# ผลที่แสดงออกในบรรทัดที่ 1 ให้ใช้ค ำสั่ง print จ ำนวน 1 ค ำสั่งเท่ำนั้น
# ผลที่แสดงออกในบรรทัดที่ 2 ให้ใช้ค ำสั่ง print จ ำนวน 4 ค ำสั่งเท่ำนั้น
# ผลที่แสดงออกในบรรทัดที่ 3 ให้ใช้ค ำสั่ง print จ ำนวน 4 ค ำสั่งเท่ำนั้น
# ตัวอย่ำงกำรรันโปรแกรม
# 123456789012345678901234567890
# NAME      SCHOOL    LEVEL  AGE
# Mana      SUT           1   19

print('1234567890'*3)
print('NAME      ',end='')
print('SCHOOL    ',end='')
print('LEVEL  ',end='')
print('AGE')
print('Mana      ',end='')
print('SUT           ',end='')
print('1   ',end='')
print('19')