# 4.จงเขียนโปรแกรมเพื่อกำหนดตัวแปร location = '1234567890' และรับข้อมูลที่เป็นชื่อสกุล 
# รับข้อมูลเพศ (ตัวอักษรตัว 1 ตัว คือ M แทนผู้ชายหรือ F แทนผู้หญิง) รับข้อมูลเลขจำนวนเต็ม 4 หลัก (1000-9999)
# และรับข้อมูลเกรดเฉลี่ย 1 จำนวน จากนั้นให้แสดงข้อมูลเหล่านั้นออกที่จอภาพโดยกำหนดจำนวนช่องที่ต้องการแสดงผลคู่กับเครื่องหมาย % ต่างๆ
# แสดงชื่อ-สกุลชิดซ้ายของหัวข้อ แสดงเพศและเลขจำนวนเต็มกึ่งกลางของหัวข้อและแสดงเกรดเฉลี่ยชิดขวาของหัวข้อด้วยเลขหังจุดทศนิยม 3 ตำแหน่ง
# ดังตัวอย่างการรันโปรแกรม

# NAME: Ann Smith
# SEX (M/F): F
# NUMBER (1000-9999): 2233
# GPA: 3.2
# 1234567890123456789012345678901234567890
# NAME           SEX      NUMBER       GPA
# Ann Smith       F        2233      3.200

location = '1234567890'
name = str(input("NAME: "))
sex = str(input("SEX (M/F): "))
number = int(input("NUMBER (1000-9999): "))
gpa = float(input("GPA: "))

print(location*4)
print("NAME           ",end="")
print("SEX       ",end="")
print("NUMBER         ",end="")
print("GPA")
print("%0s%8s%13d%13.3f"%(name,sex,number,gpa))